# StraightLineMultiplier Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHookType..::..StraightLineMultiplier Property
RebarHookType Class See Also
---
Multiplier of bar diameter. Used to compute a default hook length. The default hook length can be overridden by the RebarBarType class.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double StraightLineMultiplier { get; set; }
```

Visual Basic
---
```text
Public Property StraightLineMultiplier As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StraightLineMultiplier {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for straightLineMultiplier is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: straightLineMultiplier must be greater than 0 and no more than 99. |

# See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace